archive/before-2018-11-10/source/2017-10-24-autoconf的例子.org
#+AUTHOR: Peng Xie
#+EMAIL: pengpengxpplay@gmail.com
#+SETUPFILE: theme.setup
#+OPTIONS: ^:{}
#+TITLE: 2017-10-24-autoconf的例子

* 目录                                                                  :toc_2_org:
- [[autoconf example][autoconf example]]
- [[libtool example][libtool example]]
- [[后续补充][后续补充]]
  - [[根目录中的 =config.h= 文件][根目录中的 =config.h= 文件]]
- [[工具链][工具链]]
  - [[autoscan][autoscan]]
  - [[ifnames][ifnames]]
  - [[autoconf][autoconf]]
  - [[autoreconf][autoreconf]]
  - [[libtool][libtool]]
- [[参考资料][参考资料]]
- [[MISC note][MISC note]]
  - [[automake变量][automake变量]]

