archive/before-2018-11-10/source/2017-10-24-autoconf的例子.org
* autoconf example
  :PROPERTIES:
  :CUSTOM_ID: autoconf-example
  :END:
  最开始的目录结构是这样的：
  #+BEGIN_EXAMPLE
.
└── src
    └── main.c

1 directory, 1 file

  #+END_EXAMPLE
  
  其中的 =main.c= 就是一个普通的 =hello,world= 程序：
  #+BEGIN_SRC C :tangle /tmp/autoconf_example/src/main.c :mkdirp yes :main no
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main(int args,char *argv[])
{
    printf("test for autoconf\n");
    return 0;
}
  #+END_SRC

  在主目录下执行  =autoscan= 生成两个新文件：
  #+BEGIN_EXAMPLE
 ➜  temp tree
.
├── autoscan.log
├── configure.scan
└── src
    └── main.c

1 directory, 3 files 
  #+END_EXAMPLE

  把 =configure.scan= 改名为 =configure.ac=[fn:1:之前叫
  =configure.in=] ， =mv configure.scan configure.ac= 当前文件长这样：
  #+BEGIN_SRC autoconf
#                                               -*- Autoconf -*-
# Process this file with autoconf to produce a configure script.

AC_PREREQ([2.69])
AC_INIT([FULL-PACKAGE-NAME], [VERSION], [BUG-REPORT-ADDRESS])
AC_CONFIG_SRCDIR([src/main.c])
AC_CONFIG_HEADERS([config.h])

# Checks for programs.
AC_PROG_CC

# Checks for libraries.

# Checks for header files.
AC_CHECK_HEADERS([stdlib.h string.h])

# Checks for typedefs, structures, and compiler characteristics.

# Checks for library functions.

AC_OUTPUT
  
  #+END_SRC

  在这个文件的基础上进行下简单的修改：
  #+BEGIN_SRC autoconf
#                                               -*- Autoconf -*-
# Process this file with autoconf to produce a configure script.

AC_PREREQ([2.69])
AC_INIT([peng-test], [1.0], [pengpengxppri@sina.com])
AC_CONFIG_SRCDIR([src/main.c])
AC_CONFIG_HEADERS([])

# Checks for programs.
AC_PROG_CC

# Checks for libraries.

# Checks for header files.
AC_CHECK_HEADERS([stdlib.h string.h])

# Checks for typedefs, structures, and compiler characteristics.

# Checks for library functions.

AC_OUTPUT
  
  #+END_SRC

  这个时候还 =autoconf= 只能生成 =configure= 文件，还不能生成
  =Makefile= 文件，需要在根目录和src目录下都新建一个 =Makefile.am= 的
  文件。根目录下的 =Makefile.am= 长这样：
  #+BEGIN_SRC makefile :tangle /tmp/autoconf_example/Makefile.am :mkdirp yes
AUTOMAKE_OPTIONS = foreign
SUBDIRS = src
  #+END_SRC
  第一句表示文件目录和gnu标准的格式是不同的。第二句表示子目录包括当前
  目录下的 =src= 目录。
  
  =src= 目录下的 =Makefile.am= 表这样：
  #+BEGIN_SRC makefile :tangle /tmp/autoconf_example/src/Makefile.am :mkdirp yes
# what flags you want to pass to the C compiler & linker
AM_CFLAGS =
AM_LDFLAGS =

# this lists the binaries to produce, the (non-PHONY, binary) targets in
# the previous manual Makefile
bin_PROGRAMS = main
main_SOURCES = main.c
  #+END_SRC
  这个文件是最关键的。它直接指定编译时需要的选项，文件等等。主要看下面
  的 =bin_PROGRAMS= 和 =main_SOURCES= 。后面的大写我理解应该是已预定义
  好的宏。 !bin_PROGRAMS= main! 表示最后生成的可执行文件名字为 =main=
  ，使用 =make install= 安装后是安装到 =$PREFIX/bin= 目录下面。
  !main_SOURCES = main.c! 表示编译可执行文件需要的源文件只有 =main.c=
  。
  
  然后在修改根目录的 =configure.ac= ，在 =AC_INIT()= 的后面加入：
  #+BEGIN_EXAMPLE
AM_INIT_AUTOMAKE(pengtest, 1.0)
  #+END_EXAMPLE
  还需要在 =configure.ac= 中加入下面一句来生成期望生成的 =Makefile= ：
  #+BEGIN_EXAMPLE
AC_OUTPUT(Makefile src/Makefile)
  #+END_EXAMPLE
  
  最后总的 =configure.ac= 看起来是这样的：
  #+BEGIN_SRC autoconf :tangle /tmp/autoconf_example/configure.ac :mkdirp yes
#                                               -*- Autoconf -*-
# Process this file with autoconf to produce a configure script.

AC_PREREQ([2.69])
AC_INIT([pengtest], [1.0], [pengpengxppub@sina.com])
AC_CONFIG_SRCDIR([src/main.c])
AM_INIT_AUTOMAKE

# Checks for programs.
AC_PROG_CC

# Checks for libraries.

# Checks for header files.
AC_CHECK_HEADERS([stdlib.h string.h])

# Checks for typedefs, structures, and compiler characteristics.

# Checks for library functions.

AC_OUTPUT(Makefile src/Makefile)
  #+END_SRC

  此时在根目录下执行 =aclocal= 命令，生成 =aclocal.m4= 文件。它包括了
  =automake= 执行时需要用到的一些宏，比如 =AM_INIT_AUTOMAKE= 。
  
  最后在根目录下执行 =automake --add-missing= 。automake会读取
  =configure.ac= 中的内容和顶层 =Makefile.am= 的内容，再后递归地读取到
  每个子目录中的 =Makefile.am= ，为每个 =Makefile.am= 生成一个对应的
  =Makefile.in= 文件。 =--add-missing= 选项告诉automake如果出错则使用
  默认脚本来替代（忽略错误。）。此时的目录看起来是这样的了：
  #+BEGIN_EXAMPLE
  ➜  temp tree
.
├── aclocal.m4
├── autom4te.cache
│   ├── output.0
│   ├── output.1
│   ├── output.2
│   ├── output.3
│   ├── requests
│   ├── traces.0
│   ├── traces.1
│   ├── traces.2
│   └── traces.3
├── autoscan.log
├── compile -> /usr/share/automake-1.15/compile
├── config.log
├── config.status
├── configure
├── configure.ac
├── depcomp -> /usr/share/automake-1.15/depcomp
├── install-sh -> /usr/share/automake-1.15/install-sh
├── Makefile.am
├── Makefile.in
├── missing -> /usr/share/automake-1.15/missing
└── src
    ├── main.c
    ├── Makefile.am
    └── Makefile.in

2 directories, 24 files
  #+END_EXAMPLE
  
  最后，执行一次 =autoconf= ，重新生成一下 =configure= 文件。

  这样该软件的编译安装就直接 =./configure && make && make install= 就
  可以了。

  最后再写一个脚本从头搞一次：
  #+BEGIN_SRC sh :tangle /tmp/autoconf_example/build.sh :mkdirp yes
aclocal
automake --add-missing
autoconf

# all the command above can be replaced by one line:
# `autoreconf -i'
  #+END_SRC

  #+BEGIN_SRC org :tangle /tmp/autoconf_example/readme.org :mkdirp yes
run command to build from source:
,,#+BEGIN_SRC sh
sh build.sh
./configure
make
,,#+END_SRC
  #+END_SRC
