archive/before-2018-11-10/2017-10-24-autoconf的例子.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c9cb52">1. 目录&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toc_2_org">toc_2_org</span></span></a></li>
<li><a href="#autoconf-example">2. autoconf example</a></li>
<li><a href="#org45ce01c">3. libtool example</a>
<ul>
<li><a href="#org4b3bc57">3.1. tips</a></li>
</ul>
</li>
<li><a href="#org285b9cc">4. 后续补充</a>
<ul>
<li><a href="#org0a80161">4.1. <span class="todo TODO">TODO</span> 根目录中的 <code>config.h</code> 文件</a></li>
</ul>
</li>
<li><a href="#orgbb373be">5. 工具链</a>
<ul>
<li><a href="#org2897b3e">5.1. autoscan</a></li>
<li><a href="#orga11a043">5.2. ifnames</a></li>
<li><a href="#org9de265b">5.3. autoconf</a></li>
<li><a href="#org6038560">5.4. autoreconf</a></li>
<li><a href="#orgddab2b6">5.5. libtool</a></li>
</ul>
</li>
<li><a href="#org677a864">6. 参考资料</a></li>
<li><a href="#orgf2c9d8b">7. MISC note</a>
<ul>
<li><a href="#orgc79b181">7.1. automake变量</a>
<ul>
<li><a href="#org1f695a1">7.1.1. BUILT_SOURCES</a></li>
<li><a href="#orgd03f1b7">7.1.2. AM_CPPFLAGS和AM_CFLAGS</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9c9cb52" class="outline-2">
<h2 id="org9c9cb52"><span class="section-number-2">1</span> 目录&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toc_2_org">toc_2_org</span></span></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="#autoconf-example">autoconf example</a></li>
<li><a href="#org45ce01c">libtool example</a></li>
<li><a href="#org285b9cc">后续补充</a>
<ul class="org-ul">
<li><a href="#org0a80161">根目录中的 <code>config.h</code> 文件</a></li>
</ul></li>
<li><a href="#orgbb373be">工具链</a>
<ul class="org-ul">
<li><a href="#org2897b3e">autoscan</a></li>
<li><a href="#orga11a043">ifnames</a></li>
<li><a href="#org9de265b">autoconf</a></li>
<li><a href="#org6038560">autoreconf</a></li>
<li><a href="#orgddab2b6">libtool</a></li>
</ul></li>
<li><a href="#org677a864">参考资料</a></li>
<li><a href="#orgf2c9d8b">MISC note</a>
<ul class="org-ul">
<li><a href="#orgc79b181">automake变量</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc3d42d4" class="outline-2">
<h2 id="autoconf-example"><a id="orgc3d42d4"></a><span class="section-number-2">2</span> autoconf example</h2>
<div class="outline-text-2" id="text-autoconf-example">
<p>
最开始的目录结构是这样的：
</p>
<pre class="example">
.
└── src
    └── main.c

1 directory, 1 file

</pre>

<p>
其中的 <code>main.c</code> 就是一个普通的 <code>hello,world</code> 程序：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">args</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    printf(<span style="color: #ff4ea3;">"test for autoconf\n"</span>);
    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<p>
在主目录下执行  <code>autoscan</code> 生成两个新文件：
</p>
<pre class="example">
 ➜  temp tree
.
├── autoscan.log
├── configure.scan
└── src
    └── main.c

1 directory, 3 files 
</pre>

<p>
把 <code>configure.scan</code> 改名为 <code>configure.ac</code><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> ， <code>mv configure.scan configure.ac</code> 当前文件长这样：
</p>
<div class="org-src-container">
<pre class="src src-autoconf"><span style="color: #6c6c6c; font-style: italic;">#                                               </span><span style="color: #6c6c6c; font-style: italic;">-*- Autoconf -*-</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Process this file with autoconf to produce a configure script.</span>

<span style="color: #a1db00;">AC_PREREQ</span>([2.69])
<span style="color: #a1db00;">AC_INIT</span>([FULL-PACKAGE-NAME], [VERSION], [BUG-REPORT-ADDRESS])
<span style="color: #a1db00;">AC_CONFIG_SRCDIR</span>([src/main.c])
<span style="color: #a1db00;">AC_CONFIG_HEADERS</span>([config.h])

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for programs.</span>
<span style="color: #a1db00;">AC_PROG_CC</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for libraries.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for header files.</span>
<span style="color: #a1db00;">AC_CHECK_HEADERS</span>([stdlib.h string.h])

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for typedefs, structures, and compiler characteristics.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for library functions.</span>

<span style="color: #a1db00;">AC_OUTPUT</span>
  
</pre>
</div>

<p>
在这个文件的基础上进行下简单的修改：
</p>
<div class="org-src-container">
<pre class="src src-autoconf"><span style="color: #6c6c6c; font-style: italic;">#                                               </span><span style="color: #6c6c6c; font-style: italic;">-*- Autoconf -*-</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Process this file with autoconf to produce a configure script.</span>

<span style="color: #a1db00;">AC_PREREQ</span>([2.69])
<span style="color: #a1db00;">AC_INIT</span>([peng-test], [1.0], [pengpengxppri@sina.com])
<span style="color: #a1db00;">AC_CONFIG_SRCDIR</span>([src/main.c])
<span style="color: #a1db00;">AC_CONFIG_HEADERS</span>([])

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for programs.</span>
<span style="color: #a1db00;">AC_PROG_CC</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for libraries.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for header files.</span>
<span style="color: #a1db00;">AC_CHECK_HEADERS</span>([stdlib.h string.h])

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for typedefs, structures, and compiler characteristics.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for library functions.</span>

<span style="color: #a1db00;">AC_OUTPUT</span>
  
</pre>
</div>

<p>
这个时候还 <code>autoconf</code> 只能生成 <code>configure</code> 文件，还不能生成
<code>Makefile</code> 文件，需要在根目录和src目录下都新建一个 <code>Makefile.am</code> 的
文件。根目录下的 <code>Makefile.am</code> 长这样：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #ff8700;">AUTOMAKE_OPTIONS</span> = foreign
<span style="color: #ff8700;">SUBDIRS</span> = src
</pre>
</div>
<p>
第一句表示文件目录和gnu标准的格式是不同的。第二句表示子目录包括当前
目录下的 <code>src</code> 目录。
</p>

<p>
<code>src</code> 目录下的 <code>Makefile.am</code> 表这样：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">what flags you want to pass to the C compiler &amp; linker</span>
<span style="color: #ff8700;">AM_CFLAGS</span> =
<span style="color: #ff8700;">AM_LDFLAGS</span> =

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">this lists the binaries to produce, the (non-PHONY, binary) targets in</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">the previous manual Makefile</span>
<span style="color: #ff8700;">bin_PROGRAMS</span> = main
<span style="color: #ff8700;">main_SOURCES</span> = main.c
</pre>
</div>
<p>
这个文件是最关键的。它直接指定编译时需要的选项，文件等等。主要看下面
的 <code>bin_PROGRAMS</code> 和 <code>main_SOURCES</code> 。后面的大写我理解应该是已预定义
好的宏。 !bin_PROGRAMS= main! 表示最后生成的可执行文件名字为 <code>main</code>
，使用 <code>make install</code> 安装后是安装到 <code>$PREFIX/bin</code> 目录下面。
!main_SOURCES = main.c! 表示编译可执行文件需要的源文件只有 <code>main.c</code>
。
</p>

<p>
然后在修改根目录的 <code>configure.ac</code> ，在 <code>AC_INIT()</code> 的后面加入：
</p>
<pre class="example">
AM_INIT_AUTOMAKE(pengtest, 1.0)
</pre>
<p>
还需要在 <code>configure.ac</code> 中加入下面一句来生成期望生成的 <code>Makefile</code> ：
</p>
<pre class="example">
AC_OUTPUT(Makefile src/Makefile)
</pre>

<p>
最后总的 <code>configure.ac</code> 看起来是这样的：
</p>
<div class="org-src-container">
<pre class="src src-autoconf"><span style="color: #6c6c6c; font-style: italic;">#                                               </span><span style="color: #6c6c6c; font-style: italic;">-*- Autoconf -*-</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Process this file with autoconf to produce a configure script.</span>

<span style="color: #a1db00;">AC_PREREQ</span>([2.69])
<span style="color: #a1db00;">AC_INIT</span>([pengtest], [1.0], [pengpengxppub@sina.com])
<span style="color: #a1db00;">AC_CONFIG_SRCDIR</span>([src/main.c])
<span style="color: #a1db00;">AM_INIT_AUTOMAKE</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for programs.</span>
<span style="color: #a1db00;">AC_PROG_CC</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for libraries.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for header files.</span>
<span style="color: #a1db00;">AC_CHECK_HEADERS</span>([stdlib.h string.h])

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for typedefs, structures, and compiler characteristics.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for library functions.</span>

<span style="color: #a1db00;">AC_OUTPUT</span>(Makefile src/Makefile)
</pre>
</div>

<p>
此时在根目录下执行 <code>aclocal</code> 命令，生成 <code>aclocal.m4</code> 文件。它包括了
<code>automake</code> 执行时需要用到的一些宏，比如 <code>AM_INIT_AUTOMAKE</code> 。
</p>

<p>
最后在根目录下执行 <code>automake --add-missing</code> 。automake会读取
<code>configure.ac</code> 中的内容和顶层 <code>Makefile.am</code> 的内容，再后递归地读取到
每个子目录中的 <code>Makefile.am</code> ，为每个 <code>Makefile.am</code> 生成一个对应的
<code>Makefile.in</code> 文件。 <code>--add-missing</code> 选项告诉automake如果出错则使用
默认脚本来替代（忽略错误。）。此时的目录看起来是这样的了：
</p>
<pre class="example">
  ➜  temp tree
.
├── aclocal.m4
├── autom4te.cache
│   ├── output.0
│   ├── output.1
│   ├── output.2
│   ├── output.3
│   ├── requests
│   ├── traces.0
│   ├── traces.1
│   ├── traces.2
│   └── traces.3
├── autoscan.log
├── compile -&gt; /usr/share/automake-1.15/compile
├── config.log
├── config.status
├── configure
├── configure.ac
├── depcomp -&gt; /usr/share/automake-1.15/depcomp
├── install-sh -&gt; /usr/share/automake-1.15/install-sh
├── Makefile.am
├── Makefile.in
├── missing -&gt; /usr/share/automake-1.15/missing
└── src
    ├── main.c
    ├── Makefile.am
    └── Makefile.in

2 directories, 24 files
</pre>

<p>
最后，执行一次 <code>autoconf</code> ，重新生成一下 <code>configure</code> 文件。
</p>

<p>
这样该软件的编译安装就直接 <code>./configure &amp;&amp; make &amp;&amp; make install</code> 就
可以了。
</p>

<p>
最后再写一个脚本从头搞一次：
</p>
<div class="org-src-container">
<pre class="src src-sh">aclocal
automake --add-missing
autoconf

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">all the command above can be replaced by one line:</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">`autoreconf -i'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">run command to build from source:
,#+BEGIN_SRC sh
sh build.sh
./configure
make
,#+END_SRC
</pre>
</div>
</div>
</div>
