archive/before-2018-11-10/source/2017-10-24-autoconf的例子.org
* libtool example
  #+BEGIN_SRC C :tangle /tmp/libtool_example/src/main.c :mkdirp yes :main no
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "fun.h"

int main(int args,char *argv[])
{
    printf("test for autoconf\n");
    fun();
    return 0;
}
  #+END_SRC

  #+BEGIN_SRC C :tangle /tmp/libtool_example/src/fun.c :mkdirp yes :main no
#include "fun.h"

int fun()
{
    printf("test for libtools\n");
    return 0;
}
  #+END_SRC

  #+BEGIN_SRC C :tangle /tmp/libtool_example/src/fun.h :mkdirp yes :main no
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int fun();
  #+END_SRC

  #+BEGIN_SRC makefile :tangle /tmp/libtool_example/Makefile.am :mkdirp yes
AUTOMAKE_OPTIONS = foreign
SUBDIRS = src

ACLOCAL_AMFLAGS = -I m4
  #+END_SRC

  #+BEGIN_SRC makefile :tangle /tmp/libtool_example/src/Makefile.am :mkdirp yes
# what flags you want to pass to the C compiler & linker
AM_CFLAGS = -I$(top_srcdir) -I$(top_srcdir)/src
AM_LDFLAGS =

# this lists the binaries to produce, the (non-PHONY, binary) targets in
# the previous manual Makefile

lib_LTLIBRARIES = libpeng.la
libpeng_la_SOURCES = fun.c fun.h
libpeng_la_LDFLAGS = -version-info 0:0:0

bin_PROGRAMS = main
main_SOURCES = main.c
main_LDADD = libpeng.la
  #+END_SRC
  #+BEGIN_SRC autoconf :tangle /tmp/libtool_example/configure.ac :mkdirp yes
#                                               -*- Autoconf -*-
# Process this file with autoconf to produce a configure script.

AC_PREREQ([2.69])
AC_INIT([pengtest], [1.0], [pengpengxppub@sina.com])
AC_CONFIG_SRCDIR([src/main.c])
AM_INIT_AUTOMAKE

# Checks for programs.
AC_PROG_CC

# Checks for libraries.

# Checks for header files.
AC_CHECK_HEADERS([stdlib.h string.h])

LT_INIT

AC_CONFIG_MACRO_DIRS([m4])

# Checks for typedefs, structures, and compiler characteristics.

# Checks for library functions.

AC_OUTPUT(Makefile src/Makefile)
  #+END_SRC
  #+BEGIN_SRC sh :tangle /tmp/libtool_example/build.sh :mkdirp yes
libtoolize
aclocal
automake --add-missing
autoconf

# all the command above can be replaced by one line:
# `autoreconf -i'
  #+END_SRC

  #+BEGIN_SRC org :tangle /tmp/libtool_example/readme.org :mkdirp yes
run command to build from source:
,#+BEGIN_SRC sh
sh build.sh
./configure
make
,#+END_SRC
  #+END_SRC

** tips
   在git仓库中， =libtoolize= 默认会在git的root目录创建一个
   =ltmain.sh= 的文件，但是有我们把第三方库代码拿回来，不想以git
   submodule的方式使用，直接copy源码到我们的仓库时，使用 =libtoolize=
   生成的 =ltmain.sh= 就会出现在我们仓库的根目录而不是在对应第三方库的
   当前目录。

   解决这个问题，可以在 =configure.ac= 中加入下面这句这ok了，强制在当
   前目录生成：
   #+BEGIN_EXAMPLE
AC_CONFIG_AUX_DIR([.])
   #+END_EXAMPLE
* 后续补充
** TODO 根目录中的 =config.h= 文件
   - State "TODO"       from              [2017-10-24 二 11:37]
   默认使用 =autoscan= 扫描的时候生成的 =configure.scan= 中有一条：
   #+BEGIN_EXAMPLE
AC_CONFIG_HEADERS([config.h])
   #+END_EXAMPLE
  
   上面的例子中为了简单我把其中的 =config.h= 删掉了。实际使用时，如果使
   用 =autoreconf -i= 来自动进行上述过程，会报下面的错误：
   #+BEGIN_EXAMPLE
  ➜  temp autoreconf -i          
autoheader: error: AC_CONFIG_HEADERS not found in configure.ac
autoreconf: /usr/bin/autoheader failed with exit status: 1
   #+END_EXAMPLE
  
   于是试着加回去，然后到 =automake= 的时候会报错，提示文件找不到：
   #+BEGIN_EXAMPLE
configure.ac:8: error: required file 'config.h.in' not found
   #+END_EXAMPLE

* 工具链
** autoscan 
   帮忙生成 =configure.scan= 。可以在其上改出 =configure.ac= 。
** ifnames
   可以扫出文件中所有使用的宏。 它的功能用洋文叫 =List Conditionals= 。
   #+BEGIN_EXAMPLE
➜  src cat main.c  
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "config.h"

int main(int args, char *argv[])
{
#ifdef PENG
        printf("yestest for autoconf\n");
#else
        printf("no\n");
#endif
        return 0;
}
➜  src ifnames main.c
PENG main.c
   #+END_EXAMPLE
** autoconf
   用于生成 =configure= 的工具。不带参数执行时，它会结合M4的宏处理器来
   处理 =configure.ac= ，然后生成 =configure= 文件。如果后面指定某文件，
   它会根据指定的文件来处理，并输出到标准输出。
   
   autoconf的宏没可能分布在不同的地方。 =acsite.m4= 和 =aclocal.m4= 等。
   如果同一个宏在不同的地方定义，以最后一次定义为准。
** autoreconf
   autoconf, autoheader, aclocal, automake, libtoolize, autopoint这些工
   具多次调用很烦， =autoreconf= 可以自动地来调用它们，来更新编译系统。
** libtool
   它解决库的问题。不同的环境上支持的不同，有的只支持共享库，有的只支
   持静态库，有的两者都支持。它就是来解决这些问题的。

   详细使用上可以参考官网 [[https://www.gnu.org/software/libtool/manual/libtool.html][Libtool]] 。
   
   我觉得就是在平时编译链接的gcc命令前面加入 =libtool= 就可以了：
   #+BEGIN_EXAMPLE
libtool --mode=compile gcc -g -O -c foo.c

libtool --mode=link gcc -g -O -o libhello.la foo.o hello.o

libtool --mode=link gcc -g -O -o hell main.o libhello.la
   
   #+END_EXAMPLE
   
* 参考资料
  [[http://mij.oltrelinux.com/devel/autoconf-automake/][autoconf automake tutorial]]

  [[https://www.gnu.org/software/autoconf/manual/autoconf.html][Autoconf Manual]]

  [[https://www.gnu.org/software/libtool/manual/libtool.html][Libtool]]

* MISC note
** automake变量
