archive/before-2018-11-10/2017-10-24-autoconf的例子.html
<div id="outline-container-org45ce01c" class="outline-2">
<h2 id="org45ce01c"><span class="section-number-2">3</span> libtool example</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">"fun.h"</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">args</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    printf(<span style="color: #ff4ea3;">"test for autoconf\n"</span>);
    fun();
    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">"fun.h"</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">fun</span>()
{
    printf(<span style="color: #ff4ea3;">"test for libtools\n"</span>);
    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">fun</span>();
</pre>
</div>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #ff8700;">AUTOMAKE_OPTIONS</span> = foreign
<span style="color: #ff8700;">SUBDIRS</span> = src

<span style="color: #ff8700;">ACLOCAL_AMFLAGS</span> = -I m4
</pre>
</div>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">what flags you want to pass to the C compiler &amp; linker</span>
<span style="color: #ff8700;">AM_CFLAGS</span> = -I$(<span style="color: #ff8700;">top_srcdir</span>) -I$(<span style="color: #ff8700;">top_srcdir</span>)/src
<span style="color: #ff8700;">AM_LDFLAGS</span> =

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">this lists the binaries to produce, the (non-PHONY, binary) targets in</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">the previous manual Makefile</span>

<span style="color: #ff8700;">lib_LTLIBRARIES</span> = libpeng.la
<span style="color: #ff8700;">libpeng_la_SOURCES</span> = fun.c fun.h
<span style="color: #ff8700;">libpeng_la_LDFLAGS</span> = -version-info 0:0:0

<span style="color: #ff8700;">bin_PROGRAMS</span> = main
<span style="color: #ff8700;">main_SOURCES</span> = main.c
<span style="color: #ff8700;">main_LDADD</span> = libpeng.la
</pre>
</div>
<div class="org-src-container">
<pre class="src src-autoconf"><span style="color: #6c6c6c; font-style: italic;">#                                               </span><span style="color: #6c6c6c; font-style: italic;">-*- Autoconf -*-</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Process this file with autoconf to produce a configure script.</span>

<span style="color: #a1db00;">AC_PREREQ</span>([2.69])
<span style="color: #a1db00;">AC_INIT</span>([pengtest], [1.0], [pengpengxppub@sina.com])
<span style="color: #a1db00;">AC_CONFIG_SRCDIR</span>([src/main.c])
<span style="color: #a1db00;">AM_INIT_AUTOMAKE</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for programs.</span>
<span style="color: #a1db00;">AC_PROG_CC</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for libraries.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for header files.</span>
<span style="color: #a1db00;">AC_CHECK_HEADERS</span>([stdlib.h string.h])

LT_INIT

<span style="color: #a1db00;">AC_CONFIG_MACRO_DIRS</span>([m4])

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for typedefs, structures, and compiler characteristics.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for library functions.</span>

<span style="color: #a1db00;">AC_OUTPUT</span>(Makefile src/Makefile)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-sh">libtoolize
aclocal
automake --add-missing
autoconf

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">all the command above can be replaced by one line:</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">`autoreconf -i'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">run command to build from source:
<span style="color: #eeeeee; background-color: #005f87;">#+BEGIN_SRC sh</span>
<span style="color: #5fafd7; background-color: #3a3a3a;">sh build.sh</span>
<span style="color: #5fafd7; background-color: #3a3a3a;">./configure</span>
<span style="color: #5fafd7; background-color: #3a3a3a;">make</span>
<span style="color: #4e4e4e; background-color: #3a3a3a;">#+END_SRC</span>
</pre>
</div>
</div>

<div id="outline-container-org4b3bc57" class="outline-3">
<h3 id="org4b3bc57"><span class="section-number-3">3.1</span> tips</h3>
<div class="outline-text-3" id="text-3-1">
<p>
在git仓库中， <code>libtoolize</code> 默认会在git的root目录创建一个
<code>ltmain.sh</code> 的文件，但是有我们把第三方库代码拿回来，不想以git
submodule的方式使用，直接copy源码到我们的仓库时，使用 <code>libtoolize</code>
生成的 <code>ltmain.sh</code> 就会出现在我们仓库的根目录而不是在对应第三方库的
当前目录。
</p>

<p>
解决这个问题，可以在 <code>configure.ac</code> 中加入下面这句这ok了，强制在当
前目录生成：
</p>
<pre class="example">
AC_CONFIG_AUX_DIR([.])
</pre>
</div>
</div>
</div>
<div id="outline-container-org285b9cc" class="outline-2">
<h2 id="org285b9cc"><span class="section-number-2">4</span> 后续补充</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0a80161" class="outline-3">
<h3 id="org0a80161"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> 根目录中的 <code>config.h</code> 文件</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>State "TODO"       from              <span class="timestamp-wrapper"><span class="timestamp">[2017-10-24 Tue 11:37]</span></span></li>
</ul>
<p>
默认使用 <code>autoscan</code> 扫描的时候生成的 <code>configure.scan</code> 中有一条：
</p>
<pre class="example">
AC_CONFIG_HEADERS([config.h])
</pre>

<p>
上面的例子中为了简单我把其中的 <code>config.h</code> 删掉了。实际使用时，如果使
用 <code>autoreconf -i</code> 来自动进行上述过程，会报下面的错误：
</p>
<pre class="example">
  ➜  temp autoreconf -i          
autoheader: error: AC_CONFIG_HEADERS not found in configure.ac
autoreconf: /usr/bin/autoheader failed with exit status: 1
</pre>

<p>
于是试着加回去，然后到 <code>automake</code> 的时候会报错，提示文件找不到：
</p>
<pre class="example">
configure.ac:8: error: required file 'config.h.in' not found
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb373be" class="outline-2">
<h2 id="orgbb373be"><span class="section-number-2">5</span> 工具链</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org2897b3e" class="outline-3">
<h3 id="org2897b3e"><span class="section-number-3">5.1</span> autoscan</h3>
<div class="outline-text-3" id="text-5-1">
<p>
帮忙生成 <code>configure.scan</code> 。可以在其上改出 <code>configure.ac</code> 。
</p>
</div>
</div>
<div id="outline-container-orga11a043" class="outline-3">
<h3 id="orga11a043"><span class="section-number-3">5.2</span> ifnames</h3>
<div class="outline-text-3" id="text-5-2">
<p>
可以扫出文件中所有使用的宏。 它的功能用洋文叫 <code>List Conditionals</code> 。
</p>
<pre class="example">
➜  src cat main.c  
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;string.h&gt;
#include "config.h"

int main(int args, char *argv[])
{
#ifdef PENG
        printf("yestest for autoconf\n");
#else
        printf("no\n");
#endif
        return 0;
}
➜  src ifnames main.c
PENG main.c
</pre>
</div>
</div>
<div id="outline-container-org9de265b" class="outline-3">
<h3 id="org9de265b"><span class="section-number-3">5.3</span> autoconf</h3>
<div class="outline-text-3" id="text-5-3">
<p>
用于生成 <code>configure</code> 的工具。不带参数执行时，它会结合M4的宏处理器来
处理 <code>configure.ac</code> ，然后生成 <code>configure</code> 文件。如果后面指定某文件，
它会根据指定的文件来处理，并输出到标准输出。
</p>

<p>
autoconf的宏没可能分布在不同的地方。 <code>acsite.m4</code> 和 <code>aclocal.m4</code> 等。
如果同一个宏在不同的地方定义，以最后一次定义为准。
</p>
</div>
</div>
<div id="outline-container-org6038560" class="outline-3">
<h3 id="org6038560"><span class="section-number-3">5.4</span> autoreconf</h3>
<div class="outline-text-3" id="text-5-4">
<p>
autoconf, autoheader, aclocal, automake, libtoolize, autopoint这些工
具多次调用很烦， <code>autoreconf</code> 可以自动地来调用它们，来更新编译系统。
</p>
</div>
</div>
<div id="outline-container-orgddab2b6" class="outline-3">
<h3 id="orgddab2b6"><span class="section-number-3">5.5</span> libtool</h3>
<div class="outline-text-3" id="text-5-5">
<p>
它解决库的问题。不同的环境上支持的不同，有的只支持共享库，有的只支
持静态库，有的两者都支持。它就是来解决这些问题的。
</p>

<p>
详细使用上可以参考官网 <a href="https://www.gnu.org/software/libtool/manual/libtool.html">Libtool</a> 。
</p>

<p>
我觉得就是在平时编译链接的gcc命令前面加入 <code>libtool</code> 就可以了：
</p>
<pre class="example">
libtool --mode=compile gcc -g -O -c foo.c

libtool --mode=link gcc -g -O -o libhello.la foo.o hello.o

libtool --mode=link gcc -g -O -o hell main.o libhello.la
   
</pre>
</div>
</div>
</div>

<div id="outline-container-org677a864" class="outline-2">
<h2 id="org677a864"><span class="section-number-2">6</span> 参考资料</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="http://mij.oltrelinux.com/devel/autoconf-automake/">autoconf automake tutorial</a>
</p>

<p>
<a href="https://www.gnu.org/software/autoconf/manual/autoconf.html">Autoconf Manual</a>
</p>

<p>
<a href="https://www.gnu.org/software/libtool/manual/libtool.html">Libtool</a>
</p>
</div>
</div>
