archive/before-2018-11-10/source/2017-10-24-autoconf的例子.org
*** BUILT_SOURCES
    假设一种场景， =foo.c= 中include了 =foo.h= 。正常情况下
    =foo.c,foo.h= 都存在的情况下。从 =foo.c= 中编出 =foo.o= 是很容易的。
    因为依赖关系是明确的且文件都是静态存在的。但是如果 =foo.h= 可能需
    要的编译时通过脚本或者其它方式生成时，编译 =foo.o= 时可能因为缺少
    =foo.h= 而失败。
    
    该变量就是为这种情形存在的。它包括的文件可以在 =make all= 和 =make
    check= 中被生成。
    
    把下面两个文件保存到一个目录，然后执行 =autoreconf -i= 。然后
    =./configure && make= 就会发现 =echo= 语句会在最开始运行。
    
    #+BEGIN_SRC makefile :tangle /tmp/build_sources_example/Makefile.am :mkdirp yes
AUTOMAKE_OPTIONS = foreign

ACLOCAL_AMFLAGS = -I m4

BUILT_SOURCES = foo.h

foo.h:
	echo "xiepeng"
    #+END_SRC

    #+BEGIN_SRC autoconf :tangle /tmp/build_sources_example/configure.ac :mkdirp yes
# Process this file with autoconf to produce a configure script.

AC_PREREQ([2.69])
AC_INIT([pengtest], [1.0], [pengpengxppub@sina.com])
AC_CONFIG_SRCDIR([])
AM_INIT_AUTOMAKE

# Checks for programs.
AC_PROG_CC

# Checks for libraries.

# Checks for header files.
AC_CHECK_HEADERS([stdlib.h string.h])

LT_INIT

AC_CONFIG_MACRO_DIRS([m4])

# Checks for typedefs, structures, and compiler characteristics.

# Checks for library functions.

AC_OUTPUT(Makefile)
    #+END_SRC
    
    *需要注意的是* ：该变量只是遵循 =make all, make check, make
     install= 这三个。也就是说如果最开始的时候直接指定编 =make foo= 可
     能是通不过的。这时候可能需要先使用 =make all= 然后才能编过 =make
     foo= 。
*** AM_CPPFLAGS和AM_CFLAGS
    AM_CPPFLAGS中的flag会传给调用预处理的每一次编译。
    
    AM_CFLAGS传递一些额外的编译参数。

    以 [[#autoconf-example][autoconf example]] 中的例子来说，如果我们把src中的 =Makefile.am=
    改一下：
    #+BEGIN_SRC makefile
# what flags you want to pass to the C compiler & linker
AM_CPPFLAGS = -DXIEPENG1
AM_CFLAGS = -D XIEPENG2
AM_LDFLAGS =

# this lists the binaries to produce, the (non-PHONY, binary) targets in
# the previous manual Makefile
bin_PROGRAMS = main
main_SOURCES = main.c
    #+END_SRC
    编译输出如下：
    #+BEGIN_EXAMPLE
/tmp/autoconf_example $ make
Making all in src
make[1]: Entering directory '/tmp/autoconf_example/src'
gcc -DPACKAGE_NAME=\"pengtest\" -DPACKAGE_TARNAME=\"pengtest\" -DPACKAGE_VERSION=\"1.0\" -DPACKAGE_STRING=\"pengtest\ 1.0\" -DPACKAGE_BUGREPORT=\"pengpengxppub@sina.com\" -DPACKAGE_URL=\"\" -DPACKAGE=\"pengtest\" -DVERSION=\"1.0\" -DSTDC_HEADERS=1 -DHAVE_SYS_TYPES_H=1 -DHAVE_SYS_STAT_H=1 -DHAVE_STDLIB_H=1 -DHAVE_STRING_H=1 -DHAVE_MEMORY_H=1 -DHAVE_STRINGS_H=1 -DHAVE_INTTYPES_H=1 -DHAVE_STDINT_H=1 -DHAVE_UNISTD_H=1 -DHAVE_STDLIB_H=1 -DHAVE_STRING_H=1 -I.  -DXIEPENG1  -DXIEPENG2 -g -O2 -MT main.o -MD -MP -MF .deps/main.Tpo -c -o main.o main.c
mv -f .deps/main.Tpo .deps/main.Po
gcc -DXIEPENG2 -g -O2   -o main main.o  
make[1]: Leaving directory '/tmp/autoconf_example/src'
make[1]: Entering directory '/tmp/autoconf_example'
make[1]: Nothing to be done for 'all-am'.
make[1]: Leaving directory '/tmp/autoconf_example'
/tmp/autoconf_example $ 
    #+END_EXAMPLE
    
    上述两个参数都会被每个单独编译中的 =xxx_CPPFLAGS= 和 =xxx_CFLAGS=
    覆盖。 还是以 [[#autoconf-example][autoconf example]] 中的例子来说，如果我们再把src中的
    =Makefile.am= 改一下：
    #+BEGIN_SRC makefile
# what flags you want to pass to the C compiler & linker
AM_CPPFLAGS = -DXIEPENG1
AM_CFLAGS = -DXIEPENG2
AM_LDFLAGS =

# this lists the binaries to produce, the (non-PHONY, binary) targets in
# the previous manual Makefile
bin_PROGRAMS = main
main_SOURCES = main.c
main_CFLAGS = -DXIEPENG3
main_CPPFLAGS = -DXIEPENG4
    #+END_SRC
    看下编译输出：
    #+BEGIN_EXAMPLE
/tmp/autoconf_example $ make
Making all in src
make[1]: Entering directory '/tmp/autoconf_example/src'
gcc -DPACKAGE_NAME=\"pengtest\" -DPACKAGE_TARNAME=\"pengtest\" -DPACKAGE_VERSION=\"1.0\" -DPACKAGE_STRING=\"pengtest\ 1.0\" -DPACKAGE_BUGREPORT=\"pengpengxppub@sina.com\" -DPACKAGE_URL=\"\" -DPACKAGE=\"pengtest\" -DVERSION=\"1.0\" -DSTDC_HEADERS=1 -DHAVE_SYS_TYPES_H=1 -DHAVE_SYS_STAT_H=1 -DHAVE_STDLIB_H=1 -DHAVE_STRING_H=1 -DHAVE_MEMORY_H=1 -DHAVE_STRINGS_H=1 -DHAVE_INTTYPES_H=1 -DHAVE_STDINT_H=1 -DHAVE_UNISTD_H=1 -DHAVE_STDLIB_H=1 -DHAVE_STRING_H=1 -I.  -DXIEPENG4  -DXIEPENG3 -g -O2 -MT main-main.o -MD -MP -MF .deps/main-main.Tpo -c -o main-main.o `test -f 'main.c' || echo './'`main.c
mv -f .deps/main-main.Tpo .deps/main-main.Po
gcc -DXIEPENG3 -g -O2   -o main main-main.o  
make[1]: Leaving directory '/tmp/autoconf_example/src'
make[1]: Entering directory '/tmp/autoconf_example'
make[1]: Nothing to be done for 'all-am'.
make[1]: Leaving directory '/tmp/autoconf_example'
/tmp/autoconf_example $ 
    #+END_EXAMPLE
