archive/before-2018-11-10/2017-10-24-autoconf的例子.html

<div id="outline-container-orgf2c9d8b" class="outline-2">
<h2 id="orgf2c9d8b"><span class="section-number-2">7</span> MISC note</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgc79b181" class="outline-3">
<h3 id="orgc79b181"><span class="section-number-3">7.1</span> automake变量</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org1f695a1" class="outline-4">
<h4 id="org1f695a1"><span class="section-number-4">7.1.1</span> BUILT_SOURCES</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
假设一种场景， <code>foo.c</code> 中include了 <code>foo.h</code> 。正常情况下
<code>foo.c,foo.h</code> 都存在的情况下。从 <code>foo.c</code> 中编出 <code>foo.o</code> 是很容易的。
因为依赖关系是明确的且文件都是静态存在的。但是如果 <code>foo.h</code> 可能需
要的编译时通过脚本或者其它方式生成时，编译 <code>foo.o</code> 时可能因为缺少
<code>foo.h</code> 而失败。
</p>

<p>
该变量就是为这种情形存在的。它包括的文件可以在 <code>make all</code> 和 <code>make
    check</code> 中被生成。
</p>

<p>
把下面两个文件保存到一个目录，然后执行 <code>autoreconf -i</code> 。然后
<code>./configure &amp;&amp; make</code> 就会发现 <code>echo</code> 语句会在最开始运行。
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #ff8700;">AUTOMAKE_OPTIONS</span> = foreign

<span style="color: #ff8700;">ACLOCAL_AMFLAGS</span> = -I m4

<span style="color: #ff8700;">BUILT_SOURCES</span> = foo.h

<span style="color: #ffd700;">foo.h</span>:
        echo <span style="color: #ff4ea3;">"xiepeng"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-autoconf"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Process this file with autoconf to produce a configure script.</span>

<span style="color: #a1db00;">AC_PREREQ</span>([2.69])
<span style="color: #a1db00;">AC_INIT</span>([pengtest], [1.0], [pengpengxppub@sina.com])
<span style="color: #a1db00;">AC_CONFIG_SRCDIR</span>([])
<span style="color: #a1db00;">AM_INIT_AUTOMAKE</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for programs.</span>
<span style="color: #a1db00;">AC_PROG_CC</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for libraries.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for header files.</span>
<span style="color: #a1db00;">AC_CHECK_HEADERS</span>([stdlib.h string.h])

LT_INIT

<span style="color: #a1db00;">AC_CONFIG_MACRO_DIRS</span>([m4])

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for typedefs, structures, and compiler characteristics.</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Checks for library functions.</span>

<span style="color: #a1db00;">AC_OUTPUT</span>(Makefile)
</pre>
</div>

<p>
<b>需要注意的是</b> ：该变量只是遵循 <code>make all, make check, make
     install</code> 这三个。也就是说如果最开始的时候直接指定编 <code>make foo</code> 可
 能是通不过的。这时候可能需要先使用 <code>make all</code> 然后才能编过 <code>make
     foo</code> 。
</p>
</div>
</div>
<div id="outline-container-orgd03f1b7" class="outline-4">
<h4 id="orgd03f1b7"><span class="section-number-4">7.1.2</span> AM_CPPFLAGS和AM_CFLAGS</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
AM_CPPFLAGS中的flag会传给调用预处理的每一次编译。
</p>

<p>
AM_CFLAGS传递一些额外的编译参数。
</p>

<p>
以 <a href="#autoconf-example">autoconf example</a> 中的例子来说，如果我们把src中的 <code>Makefile.am</code>
改一下：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">what flags you want to pass to the C compiler &amp; linker</span>
<span style="color: #ff8700;">AM_CPPFLAGS</span> = -DXIEPENG1
<span style="color: #ff8700;">AM_CFLAGS</span> = -D XIEPENG2
<span style="color: #ff8700;">AM_LDFLAGS</span> =

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">this lists the binaries to produce, the (non-PHONY, binary) targets in</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">the previous manual Makefile</span>
<span style="color: #ff8700;">bin_PROGRAMS</span> = main
<span style="color: #ff8700;">main_SOURCES</span> = main.c
</pre>
</div>
<p>
编译输出如下：
</p>
<pre class="example">
/tmp/autoconf_example $ make
Making all in src
make[1]: Entering directory '/tmp/autoconf_example/src'
gcc -DPACKAGE_NAME=\"pengtest\" -DPACKAGE_TARNAME=\"pengtest\" -DPACKAGE_VERSION=\"1.0\" -DPACKAGE_STRING=\"pengtest\ 1.0\" -DPACKAGE_BUGREPORT=\"pengpengxppub@sina.com\" -DPACKAGE_URL=\"\" -DPACKAGE=\"pengtest\" -DVERSION=\"1.0\" -DSTDC_HEADERS=1 -DHAVE_SYS_TYPES_H=1 -DHAVE_SYS_STAT_H=1 -DHAVE_STDLIB_H=1 -DHAVE_STRING_H=1 -DHAVE_MEMORY_H=1 -DHAVE_STRINGS_H=1 -DHAVE_INTTYPES_H=1 -DHAVE_STDINT_H=1 -DHAVE_UNISTD_H=1 -DHAVE_STDLIB_H=1 -DHAVE_STRING_H=1 -I.  -DXIEPENG1  -DXIEPENG2 -g -O2 -MT main.o -MD -MP -MF .deps/main.Tpo -c -o main.o main.c
mv -f .deps/main.Tpo .deps/main.Po
gcc -DXIEPENG2 -g -O2   -o main main.o  
make[1]: Leaving directory '/tmp/autoconf_example/src'
make[1]: Entering directory '/tmp/autoconf_example'
make[1]: Nothing to be done for 'all-am'.
make[1]: Leaving directory '/tmp/autoconf_example'
/tmp/autoconf_example $ 
</pre>

<p>
上述两个参数都会被每个单独编译中的 <code>xxx_CPPFLAGS</code> 和 <code>xxx_CFLAGS</code>
覆盖。 还是以 <a href="#autoconf-example">autoconf example</a> 中的例子来说，如果我们再把src中的
<code>Makefile.am</code> 改一下：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">what flags you want to pass to the C compiler &amp; linker</span>
<span style="color: #ff8700;">AM_CPPFLAGS</span> = -DXIEPENG1
<span style="color: #ff8700;">AM_CFLAGS</span> = -DXIEPENG2
<span style="color: #ff8700;">AM_LDFLAGS</span> =

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">this lists the binaries to produce, the (non-PHONY, binary) targets in</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">the previous manual Makefile</span>
<span style="color: #ff8700;">bin_PROGRAMS</span> = main
<span style="color: #ff8700;">main_SOURCES</span> = main.c
<span style="color: #ff8700;">main_CFLAGS</span> = -DXIEPENG3
<span style="color: #ff8700;">main_CPPFLAGS</span> = -DXIEPENG4
</pre>
</div>
<p>
看下编译输出：
</p>
<pre class="example">
/tmp/autoconf_example $ make
Making all in src
make[1]: Entering directory '/tmp/autoconf_example/src'
gcc -DPACKAGE_NAME=\"pengtest\" -DPACKAGE_TARNAME=\"pengtest\" -DPACKAGE_VERSION=\"1.0\" -DPACKAGE_STRING=\"pengtest\ 1.0\" -DPACKAGE_BUGREPORT=\"pengpengxppub@sina.com\" -DPACKAGE_URL=\"\" -DPACKAGE=\"pengtest\" -DVERSION=\"1.0\" -DSTDC_HEADERS=1 -DHAVE_SYS_TYPES_H=1 -DHAVE_SYS_STAT_H=1 -DHAVE_STDLIB_H=1 -DHAVE_STRING_H=1 -DHAVE_MEMORY_H=1 -DHAVE_STRINGS_H=1 -DHAVE_INTTYPES_H=1 -DHAVE_STDINT_H=1 -DHAVE_UNISTD_H=1 -DHAVE_STDLIB_H=1 -DHAVE_STRING_H=1 -I.  -DXIEPENG4  -DXIEPENG3 -g -O2 -MT main-main.o -MD -MP -MF .deps/main-main.Tpo -c -o main-main.o `test -f 'main.c' || echo './'`main.c
mv -f .deps/main-main.Tpo .deps/main-main.Po
gcc -DXIEPENG3 -g -O2   -o main main-main.o  
make[1]: Leaving directory '/tmp/autoconf_example/src'
make[1]: Entering directory '/tmp/autoconf_example'
make[1]: Nothing to be done for 'all-am'.
make[1]: Leaving directory '/tmp/autoconf_example'
/tmp/autoconf_example $ 
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">之前叫
<code>configure.in</code></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>